<h1><center>Soccer Database</center></h1>

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2
engine = create_engine("postgresql+psycopg2://postgres:Hero33!!@localhost/Soccer")
%load_ext sql
%sql postgresql://postgres:Hero33!!@localhost/Soccer

'Connected: postgres@Soccer'

#### 1. Write a query in SQL to find the number of venues.

In [2]:
%%sql
SELECT COUNT(*)  AS number_of_venues
FROM soccer_venue;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(10,)]

In [3]:
soccer_venue = pd.read_sql("SELECT * FROM soccer_venue;", engine)
len(soccer_venue)

10

#### 2. Write a query in SQL to find the number of countries.

In [4]:
%%sql
SELECT COUNT(DISTINCT team_id) AS number_of_countries
FROM player_mast;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(24,)]

In [5]:
player_mast = pd.read_sql("SELECT * FROM player_mast", engine)
player_mast['team_id'].nunique()

24

#### 3. Write a query in SQL to find the number goals scored.

In [6]:
%%sql
SELECT COUNT(*) AS number_goals_scored
FROM goal_details;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(108,)]

In [7]:
goal_details = pd.read_sql("SELECT * FROM goal_details;", engine)
len(goal_details)

108

#### 4. Write a query in SQL to find the number of matches.

In [8]:
%%sql
SELECT COUNT(*) AS number_of_matches
FROM match_mast;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(51,)]

In [9]:
match_mast = pd.read_sql("SELECT * FROM match_mast;", engine)
len(match_mast)

51

#### 5. Write a query in SQL to find the number of matches ended with draws.

In [10]:
%%sql
SELECT COUNT(*) AS number_of_draws
FROM match_mast
WHERE results = 'DRAW';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(11,)]

In [11]:
len(match_mast[match_mast['results'].str.strip() == 'DRAW'])

11

#### 6. Write a query in SQL to find the date when EURO CUP began.

In [12]:
%%sql
SELECT MIN(play_date) AS starting_date
FROM match_mast;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(datetime.date(2016, 6, 11),)]

In [13]:
match_mast['play_date'].min()

datetime.date(2016, 6, 11)

#### 7. Write a query in SQL to find the number of self-goals scored.

In [14]:
%%sql
SELECT COUNT(*) AS number_of_self_goals
FROM goal_details
WHERE goal_type = 'O';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(3,)]

In [15]:
len(goal_details[goal_details['goal_type'] == "O"])

3

#### 8. Write a query in SQL to count the number of matches in group stage.

In [16]:
%%sql
SELECT COUNT(*) AS number_of_matches_group_stage
FROM  match_mast
WHERE play_stage = 'G';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(36,)]

In [17]:
len(match_mast[match_mast['play_stage'] == 'G'])

36

#### 9. Write a query in SQL to find the number of matches that got a result by penalty shootout.

In [18]:
%%sql
SELECT COUNT(*) AS matches_decided_on_penalties
FROM  match_mast
WHERE decided_by = 'P';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(3,)]

In [19]:
len(match_mast[match_mast['decided_by'] == "P"])

3

#### 10. Write a query in SQL to find the number of matches were decided on penalties in the Round of 16.

In [20]:
%%sql
SELECT COUNT(*) AS matches_decided_on_penalties_round_16
FROM  match_mast
WHERE play_stage = 'R' 
    AND decided_by = 'P';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(1,)]

In [21]:
len(match_mast[(match_mast['play_stage'] == "R") & (match_mast['decided_by'] == "P")])

1

#### 11. Write a query in SQL to find the number of goal scored in every match within normal play schedule.

In [22]:
%%sql
SELECT  match_no,
        COUNT(*) AS number_of_goal_scored
FROM goal_details
WHERE goal_schedule = 'NT'
GROUP BY match_no
ORDER BY match_no;

 * postgresql://postgres:***@localhost/Soccer
45 rows affected.

[(Decimal('1'), 3),
 (Decimal('2'), 1),
 (Decimal('3'), 3),
 (Decimal('4'), 1),
 (Decimal('5'), 1),
 (Decimal('6'), 1),
 (Decimal('7'), 1),
 (Decimal('8'), 1),
 (Decimal('9'), 2),
 (Decimal('10'), 1),
 (Decimal('11'), 2),
 (Decimal('12'), 2),
 (Decimal('13'), 3),
 (Decimal('14'), 2),
 (Decimal('15'), 1),
 (Decimal('16'), 2),
 (Decimal('17'), 1),
 (Decimal('19'), 1),
 (Decimal('20'), 4),
 (Decimal('21'), 3),
 (Decimal('22'), 3),
 (Decimal('23'), 2),
 (Decimal('25'), 1),
 (Decimal('27'), 3),
 (Decimal('29'), 1),
 (Decimal('30'), 1),
 (Decimal('31'), 2),
 (Decimal('32'), 3),
 (Decimal('33'), 2),
 (Decimal('34'), 6),
 (Decimal('35'), 1),
 (Decimal('36'), 1),
 (Decimal('37'), 2),
 (Decimal('38'), 1),
 (Decimal('40'), 3),
 (Decimal('41'), 3),
 (Decimal('42'), 4),
 (Decimal('43'), 1),
 (Decimal('44'), 3),
 (Decimal('45'), 2),
 (Decimal('46'), 4),
 (Decimal('47'), 2),
 (Decimal('48'), 7),
 (Decimal('49'), 2),
 (Decimal('50'), 1)]

In [23]:
goal_details[goal_details['goal_schedule'] == "NT"].groupby(by='match_no').size()

match_no
1.0     3
2.0     1
3.0     3
4.0     1
5.0     1
6.0     1
7.0     1
8.0     1
9.0     2
10.0    1
11.0    2
12.0    2
13.0    3
14.0    2
15.0    1
16.0    2
17.0    1
19.0    1
20.0    4
21.0    3
22.0    3
23.0    2
25.0    1
27.0    3
29.0    1
30.0    1
31.0    2
32.0    3
33.0    2
34.0    6
35.0    1
36.0    1
37.0    2
38.0    1
40.0    3
41.0    3
42.0    4
43.0    1
44.0    3
45.0    2
46.0    4
47.0    2
48.0    7
49.0    2
50.0    1
dtype: int64

#### 12. Write a query in SQL to find the match no, date of play and goal scored for that match in which no stoppage time have been added in 1st half of play.

In [24]:
%%sql
SELECT  match_no,
        play_date,
        goal_score
FROM match_mast
WHERE stop1_sec = 0;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(Decimal('4'), datetime.date(2016, 6, 12), '1-1  ')]

In [25]:
match_mast[match_mast['stop1_sec'] == 0][['match_no', 'play_date', 'goal_score']]

   match_no   play_date goal_score
3       4.0  2016-06-12      1-1

#### 13. Write a query in SQL to find the number of matches ending with a goalless draw in group stage.

In [26]:
%%sql
SELECT COUNT(DISTINCT match_no) AS number_of_matches_goalless_group_stage
FROM match_details
WHERE win_lose = 'D' 
    AND goal_score = 0 
    AND play_stage = 'G';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(4,)]

In [27]:
match_details = pd.read_sql("SELECT * FROM match_details;", engine)
match_details[(match_details['win_lose'] == "D") & (match_details['goal_score'] == 0) & (match_details['play_stage'] == "G")]['match_no'].nunique()

4

#### 14. Write a query in SQL to find the total number of players replaced in the tournament.

In [28]:
%%sql
SELECT COUNT(*) AS number_of_players_replaced
FROM player_in_out
WHERE in_out = 'I';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(293,)]

In [29]:
player_in_out = pd.read_sql("SELECT * FROM player_in_out;", engine)
len(player_in_out[player_in_out['in_out'] == 'I'])

293

#### 15. Write a query in SQL to find the total number of players replaced within normal time of play.

In [30]:
%%sql
SELECT COUNT(*) AS player_replaced_normal_time
FROM player_in_out
WHERE play_schedule = 'NT' 
    AND in_out = 'I';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(275,)]

In [31]:
len(player_in_out[(player_in_out['in_out'] == 'I') & (player_in_out['play_schedule'] == "NT")])

275

#### 16. Write a query in SQL to find the number of players replaced in the stoppage time.

In [32]:
%%sql
SELECT COUNT(*) AS number_of_players_replaced_stoppage_time
FROM player_in_out
WHERE in_out = 'I' 
    AND play_schedule = 'ST';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(9,)]

In [33]:
len(player_in_out[(player_in_out['in_out'] == 'I') & (player_in_out['play_schedule'] == "ST")])

9

#### 17. Write a query in SQL to find the total number of players replaced in the first half.

In [34]:
%%sql
SELECT COUNT(*) AS number_of_players_replaced_first_half
FROM player_in_out
WHERE in_out = 'I' 
    AND play_half = 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(7,)]

In [35]:
len(player_in_out[(player_in_out['in_out'] == 'I') & (player_in_out['play_half'] == 1)])

7

#### 18. Write a query in SQL to find the total number of goalless draws.

In [36]:
%%sql
SELECT COUNT(DISTINCT match_no) AS number_of_matches_goalless_draws
FROM match_details
WHERE goal_score = 0 
    AND win_lose = 'D';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(4,)]

In [37]:
match_details[(match_details['goal_score'] == 0) & (match_details['win_lose'] == "D")]['match_no'].nunique()

4

#### 19. Write a query in SQL to find the total number of players replaced in the extra time.

In [38]:
%%sql
SELECT COUNT(*) AS players_replaced_extra_time
FROM player_in_out
WHERE in_out = 'I' 
    AND play_schedule = 'ET';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(9,)]

In [39]:
len(player_in_out[(player_in_out['in_out'] == 'I') & (player_in_out['play_schedule'] == "ET")])

9

#### 20. Write a query in SQL to compute a list to show the number of substitute happened in various stage of the tournament.

In [40]:
%%sql
SELECT  play_schedule,
        play_half,
        COUNT(*) AS number_of_substitute
FROM player_in_out
WHERE in_out = 'I'
GROUP BY play_schedule, play_half
ORDER BY play_schedule, play_half;

 * postgresql://postgres:***@localhost/Soccer
5 rows affected.

[('ET', Decimal('1'), 4),
 ('ET', Decimal('2'), 5),
 ('NT', Decimal('1'), 3),
 ('NT', Decimal('2'), 272),
 ('ST', Decimal('2'), 9)]

In [41]:
player_in_out[player_in_out['in_out'] == 'I'].groupby(by=['play_schedule', 'play_half']).size()

play_schedule  play_half
ET             1.0            4
               2.0            5
NT             1.0            3
               2.0          272
ST             2.0            9
dtype: int64

#### 21. Write a query in SQL to find the number of shots missed or saved in penalty shootout matches.

In [42]:
%%sql
SELECT COUNT(*) AS shots_missed_or_saved
FROM penalty_shootout
WHERE score_goal = 'N';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(9,)]

In [43]:
penalty_shootout = pd.read_sql("SELECT * FROM penalty_shootout", engine)
len(penalty_shootout[penalty_shootout['score_goal'] == "N"])

9

#### 22. Write a query in SQL to prepare a list of players with number of shots taken in penalty shootout matches.

In [44]:
%%sql
SELECT  pl.player_name,
        COUNT(*) AS number_of_shots
FROM penalty_shootout pe
INNER JOIN player_mast pl
    ON pe.player_id = pl.player_id
GROUP BY pl.player_name;

 * postgresql://postgres:***@localhost/Soccer
33 rows affected.

[('Joshua Kimmich ', 1),
 ('Leonardo Bonucci ', 1),
 ('Jakub Blaszczykowski ', 2),
 ('Renato Sanches ', 1),
 ('Stephan Lichtsteiner ', 1),
 ('Cristiano Ronaldo ', 1),
 ('Xherdan Shaqiri ', 1),
 ('Ricardo Quaresma ', 1),
 ('Thomas Muller ', 1),
 ('Marco Parolo ', 1),
 ('Graziano Pelle', 1),
 ('Kamil Glik ', 2),
 ('Jonas Hector ', 1),
 ('Ricardo Rodriguez ', 1),
 ('Arkadiusz Milik ', 2),
 ('Mattia De Sciglio ', 1),
 ('Lorenzo Insigne ', 1),
 ('Julian Draxler ', 1),
 ('Bastian Schweinsteiger ', 1),
 ('Andrea Barzagli ', 1),
 ('Nani ', 1),
 ('Mesut ozil ', 1),
 ('Grzegorz Krychowiak ', 1),
 ('Matteo Darmian ', 1),
 ('Granit Xhaka ', 1),
 ('Joao Moutinho ', 1),
 ('Robert Lewandowski ', 2),
 ('Toni Kroos ', 1),
 ('Emanuele Giaccherini ', 1),
 ('Simone Zaza ', 1),
 ('Jerome Boateng ', 1),
 ('Mats Hummels ', 1),
 ('Fabian Schar ', 1)]

In [45]:
pd.merge(player_mast, penalty_shootout, on='player_id').groupby(by='player_name').size()

player_name
Andrea Barzagli            1
Arkadiusz Milik            2
Bastian Schweinsteiger     1
Cristiano Ronaldo          1
Emanuele Giaccherini       1
Fabian Schar               1
Granit Xhaka               1
Graziano Pelle             1
Grzegorz Krychowiak        1
Jakub Blaszczykowski       2
Jerome Boateng             1
Joao Moutinho              1
Jonas Hector               1
Joshua Kimmich             1
Julian Draxler             1
Kamil Glik                 2
Leonardo Bonucci           1
Lorenzo Insigne            1
Marco Parolo               1
Mats Hummels               1
Matteo Darmian             1
Mattia De Sciglio          1
Mesut ozil                 1
Nani                       1
Renato Sanches             1
Ricardo Quaresma           1
Ricardo Rodriguez          1
Robert Lewandowski         2
Simone Zaza                1
Stephan Lichtsteiner       1
Thomas Muller              1
Toni Kroos                 1
Xherdan Shaqiri            1
dtype: int64

#### 23. Write a query in SQL to find the number of penalty shots taken by the teams.

In [46]:
%%sql
SELECT  s.country_name,
        COUNT(*) AS penalty_shots
FROM penalty_shootout p
INNER JOIN soccer_country s
    ON p.team_id = s.country_id
GROUP BY s.country_name
ORDER BY COUNT(*) DESC;

 * postgresql://postgres:***@localhost/Soccer
5 rows affected.

[('Italy', 9),
 ('Poland', 9),
 ('Germany', 9),
 ('Switzerland', 5),
 ('Portugal', 5)]

In [47]:
soccer_country = pd.read_sql("SELECT * FROM soccer_country", engine)
pd.merge(penalty_shootout, soccer_country, left_on='team_id', right_on='country_id').groupby(by='country_name').size()

country_name
Germany        9
Italy          9
Poland         9
Portugal       5
Switzerland    5
dtype: int64

#### 24. Write a query in SQL to find the number of booking happened in each half of play within normal play schedule.

In [48]:
%%sql
SELECT  play_half,
        COUNT(*) AS number_of_booking
FROM player_booked
WHERE play_schedule = 'NT'
GROUP BY play_half;

 * postgresql://postgres:***@localhost/Soccer
2 rows affected.

[(Decimal('1'), 61), (Decimal('2'), 123)]

In [49]:
player_booked = pd.read_sql("SELECT * FROM player_booked", engine)
player_booked[player_booked['play_schedule'] == "NT"].groupby(by="play_half").size()

play_half
1.0     61
2.0    123
dtype: int64

#### 25. Write a query in SQL to find the number of booking happened in stoppage time.

In [50]:
%%sql
SELECT COUNT(*) AS number_booking_stoppage_time
FROM player_booked
WHERE play_schedule = 'ST';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(10,)]

In [51]:
len(player_booked[player_booked['play_schedule'] == "ST"])

10

#### 26. Write a query in SQL to find the number of booking happened in extra time.

In [52]:
%%sql
SELECT COUNT(*) AS number_booking_extra_time
FROM player_booked
WHERE play_schedule = 'ET';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(7,)]

In [53]:
len(player_booked[player_booked['play_schedule'] == "ET"])

7

#### 27. Write a query in SQL to find the teams played the first match of EURO cup 2016.

In [54]:
%%sql
SELECT country_name
FROM soccer_country
WHERE country_id IN (SELECT team_id
                     FROM match_details
                     WHERE match_no = 1);

 * postgresql://postgres:***@localhost/Soccer
2 rows affected.

[('France',), ('Romania',)]

In [55]:
df_merged = pd.merge(match_details, soccer_country, left_on='team_id', right_on='country_id')
df_merged[df_merged['match_no'] == 1][['country_name']]

  country_name
0       France
7      Romania

#### 28. Write a query in SQL to find the winner of EURO cup 2016.

In [56]:
%%sql
SELECT country_name
FROM soccer_country
WHERE country_id IN (SELECT team_id
                     FROM match_details
                     WHERE play_stage = 'F'
                        AND win_lose = 'W');

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Portugal',)]

In [57]:
df_merged = pd.merge(match_details, soccer_country, left_on='team_id', right_on='country_id')
df_merged[(df_merged['play_stage'] == "F") & (df_merged['win_lose'] == 'W')][['country_name']]

   country_name
96     Portugal

#### 29. Write a query in SQL to find the match no, play stage, goal scored, and the audience of the match with the heighest audience.

In [58]:
%%sql
SELECT  match_no,
        play_stage,
        goal_score,
        audence
FROM match_mast
ORDER BY audence DESC
LIMIT 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(Decimal('48'), 'Q', '5-2  ', Decimal('76833'))]

In [59]:
match_mast.sort_values(by="audence", ascending=False).iloc[0][['match_no', 'play_stage', 'goal_score', 'audence']]

match_no         48
play_stage        Q
goal_score    5-2
audence       76833
Name: 47, dtype: object

#### 30. Write a query in SQL to find the match no in which Germany played against Poland

In [60]:
%%sql
SELECT match_no
FROM match_details
WHERE team_id IN ( SELECT country_id
                  FROM soccer_country
                  WHERE country_name = 'Germany' 
                      OR country_name = 'Poland')
GROUP BY match_no
HAVING COUNT(*) = 2;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[(Decimal('18'),)]

In [61]:
df_merged = pd.merge(match_details, soccer_country, left_on='team_id', right_on='country_id')
df_merged[df_merged['country_name'].isin(["Germany","Poland"])].groupby(by='match_no').size().sort_values(ascending=False).head(1)

match_no
18.0    2
dtype: int64

#### 31. Write a query in SQL to find the team which was defeated by Portugal in EURO cup 2016 final.

In [62]:
%%sql
SELECT country_name
FROM soccer_country
WHERE country_id = (SELECT team_id
                    FROM match_details
                    WHERE play_stage = 'F'
                        AND win_lose = 'L');

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('France',)]

In [63]:
df_merged = pd.merge(soccer_country, match_details, left_on='country_id', right_on='team_id')
df_merged[(df_merged['play_stage'] == "F") & (df_merged['win_lose'] == "L")]['country_name']

28    France
Name: country_name, dtype: object

#### 32. Write a query in SQL to find the player and jersey number who scored the first penalty of the tournament.

In [64]:
%%sql
SELECT player_name,
        jersey_no
FROM player_mast
WHERE player_id = (SELECT player_id
                   FROM goal_details
                   WHERE goal_type = 'P'
                   LIMIT 1)

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Bogdan Stancu ', Decimal('19'))]

In [65]:
df_merged = pd.merge(player_mast, goal_details, on='player_id')
df_merged[df_merged['goal_type'] == "P"].sort_values(by='match_no')[["player_name", "jersey_no"]].iloc[0]

player_name    Bogdan Stancu
jersey_no                  19
Name: 82, dtype: object

#### 33. Write a query in SQL to find the name of the venue with city where the EURO cup 2016 final match was played.

In [66]:
%%sql
SELECT  sv.venue_name,
        sc.city
FROM soccer_venue sv
INNER JOIN soccer_city sc
    ON sv.city_id = sc.city_id
INNER JOIN match_mast m
    ON m.venue_id = sv.venue_id
WHERE m.play_stage = 'F';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Stade de France', 'Saint-Denis')]

In [67]:
soccer_city = pd.read_sql("SELECT * FROM soccer_city;", engine)
df_merged = pd.merge(soccer_venue, soccer_city, on='city_id')
df_merged_2 = pd.merge(df_merged, match_mast, on='venue_id')
df_merged_2[df_merged_2['play_stage'] == "F"][['venue_name', 'city']]

         venue_name         city
42  Stade de France  Saint-Denis

#### 34. Write a query in SQL to find the number of goal scored by each team in every match within normal play schedule

In [68]:
%%sql
SELECT  m.match_no,
        s.country_name,
        m.goal_score
FROM match_details m
INNER JOIN soccer_country s
    ON m.team_id = s.country_id
WHERE m.decided_by = 'N';

 * postgresql://postgres:***@localhost/Soccer
96 rows affected.

[(Decimal('1'), 'France', Decimal('2')),
 (Decimal('1'), 'Romania', Decimal('1')),
 (Decimal('2'), 'Albania', Decimal('0')),
 (Decimal('2'), 'Switzerland', Decimal('1')),
 (Decimal('3'), 'Wales', Decimal('2')),
 (Decimal('3'), 'Slovakia', Decimal('1')),
 (Decimal('4'), 'England', Decimal('1')),
 (Decimal('4'), 'Russia', Decimal('1')),
 (Decimal('5'), 'Turkey', Decimal('0')),
 (Decimal('5'), 'Croatia', Decimal('1')),
 (Decimal('6'), 'Poland', Decimal('1')),
 (Decimal('6'), 'Northern Ireland', Decimal('0')),
 (Decimal('7'), 'Germany', Decimal('2')),
 (Decimal('7'), 'Ukraine', Decimal('0')),
 (Decimal('8'), 'Spain', Decimal('1')),
 (Decimal('8'), 'Czech Republic', Decimal('0')),
 (Decimal('9'), 'Republic of Ireland', Decimal('1')),
 (Decimal('9'), 'Sweden', Decimal('1')),
 (Decimal('10'), 'Belgium', Decimal('0')),
 (Decimal('10'), 'Italy', Decimal('2')),
 (Decimal('11'), 'Austria', Decimal('0')),
 (Decimal('11'), 'Hungary', Decimal('2')),
 (Decimal('12'), 'Portugal', Decimal('1')),
 (Decimal('12'), 'Iceland', Decimal('1')),
 (Decimal('13'), 'Russia', Decimal('1')),
 (Decimal('13'), 'Slovakia', Decimal('2')),
 (Decimal('14'), 'Romania', Decimal('1')),
 (Decimal('14'), 'Switzerland', Decimal('1')),
 (Decimal('15'), 'France', Decimal('2')),
 (Decimal('15'), 'Albania', Decimal('0')),
 (Decimal('16'), 'England', Decimal('2')),
 (Decimal('16'), 'Wales', Decimal('1')),
 (Decimal('17'), 'Ukraine', Decimal('0')),
 (Decimal('17'), 'Northern Ireland', Decimal('2')),
 (Decimal('18'), 'Germany', Decimal('0')),
 (Decimal('18'), 'Poland', Decimal('0')),
 (Decimal('19'), 'Italy', Decimal('1')),
 (Decimal('19'), 'Sweden', Decimal('0')),
 (Decimal('20'), 'Czech Republic', Decimal('2')),
 (Decimal('20'), 'Croatia', Decimal('2')),
 (Decimal('21'), 'Spain', Decimal('3')),
 (Decimal('21'), 'Turkey', Decimal('0')),
 (Decimal('22'), 'Belgium', Decimal('3')),
 (Decimal('22'), 'Republic of Ireland', Decimal('0')),
 (Decimal('23'), 'Iceland', Decimal('1')),
 (Decimal('23'), 'Hungary', Decimal('1')),
 (Decimal('24'), 'Portugal', Decimal('0')),
 (Decimal('24'), 'Austria', Decimal('0')),
 (Decimal('25'), 'Romania', Decimal('0')),
 (Decimal('25'), 'Albania', Decimal('1')),
 (Decimal('26'), 'Switzerland', Decimal('0')),
 (Decimal('26'), 'France', Decimal('0')),
 (Decimal('27'), 'Russia', Decimal('0')),
 (Decimal('27'), 'Wales', Decimal('3')),
 (Decimal('28'), 'Slovakia', Decimal('0')),
 (Decimal('28'), 'England', Decimal('0')),
 (Decimal('29'), 'Ukraine', Decimal('0')),
 (Decimal('29'), 'Poland', Decimal('1')),
 (Decimal('30'), 'Northern Ireland', Decimal('0')),
 (Decimal('30'), 'Germany', Decimal('1')),
 (Decimal('31'), 'Czech Republic', Decimal('0')),
 (Decimal('31'), 'Turkey', Decimal('2')),
 (Decimal('32'), 'Croatia', Decimal('2')),
 (Decimal('32'), 'Spain', Decimal('1')),
 (Decimal('33'), 'Iceland', Decimal('2')),
 (Decimal('33'), 'Austria', Decimal('1')),
 (Decimal('34'), 'Hungary', Decimal('3')),
 (Decimal('34'), 'Portugal', Decimal('3')),
 (Decimal('35'), 'Italy', Decimal('0')),
 (Decimal('35'), 'Republic of Ireland', Decimal('1')),
 (Decimal('36'), 'Sweden', Decimal('0')),
 (Decimal('36'), 'Belgium', Decimal('1')),
 (Decimal('38'), 'Wales', Decimal('1')),
 (Decimal('38'), 'Northern Ireland', Decimal('0')),
 (Decimal('39'), 'Croatia', Decimal('0')),
 (Decimal('39'), 'Portugal', Decimal('1')),
 (Decimal('40'), 'France', Decimal('2')),
 (Decimal('40'), 'Republic of Ireland', Decimal('1')),
 (Decimal('41'), 'Germany', Decimal('3')),
 (Decimal('41'), 'Slovakia', Decimal('0')),
 (Decimal('42'), 'Hungary', Decimal('0')),
 (Decimal('42'), 'Belgium', Decimal('4')),
 (Decimal('43'), 'Italy', Decimal('2')),
 (Decimal('43'), 'Spain', Decimal('0')),
 (Decimal('44'), 'England', Decimal('1')),
 (Decimal('44'), 'Iceland', Decimal('2')),
 (Decimal('46'), 'Wales', Decimal('3')),
 (Decimal('46'), 'Belgium', Decimal('1')),
 (Decimal('48'), 'France', Decimal('5')),
 (Decimal('48'), 'Iceland', Decimal('2')),
 (Decimal('49'), 'Portugal', Decimal('2')),
 (Decimal('49'), 'Wales', Decimal('0')),
 (Decimal('50'), 'France', Decimal('2')),
 (Decimal('50'), 'Germany', Decimal('1')),
 (Decimal('51'), 'Portugal', Decimal('1')),
 (Decimal('51'), 'France', Decimal('0'))]

In [69]:
df_merged = pd.merge(match_details, soccer_country, left_on='team_id', right_on='country_id')
df_merged[df_merged['decided_by'] == "N"][['match_no', 'country_name', 'goal_score']].sort_values(by='match_no')

    match_no country_name  goal_score
0        1.0       France         2.0
7        1.0      Romania         1.0
10       2.0      Albania         0.0
13       2.0  Switzerland         1.0
23       3.0     Slovakia         1.0
..       ...          ...         ...
95      49.0     Portugal         2.0
5       50.0       France         2.0
55      50.0      Germany         1.0
6       51.0       France         0.0
96      51.0     Portugal         1.0

[96 rows x 3 columns]

#### 35. Write a query in SQL to find the total number of goals scored by each player and arrange the result set according to the heighest to lowest scorer.

In [70]:
%%sql
SELECT  p.player_name,
        COUNT(*) AS number_of_goals
FROM goal_details g
INNER JOIN player_mast p
    ON g.player_id = p.player_id
GROUP BY p.player_name
ORDER BY COUNT(*) DESC;

 * postgresql://postgres:***@localhost/Soccer
76 rows affected.

[('Antoine Griezmann ', 6),
 ('Nani ', 3),
 ('Gareth Bale ', 3),
 ('Cristiano Ronaldo ', 3),
 ('Dimitri Payet ', 3),
 ('Olivier Giroud ', 3),
 ('Alvaro Morata ', 3),
 ('Romelu Lukaku ', 2),
 ('Balazs Dzsudzsak ', 2),
 ('Ivan PeriSic ', 2),
 ('Mario Gomez ', 2),
 ('Birkir Bjarnason ', 2),
 ('Robbie Brady ', 2),
 ('Gareth McAuley ', 2),
 ('Jakub Blaszczykowski ', 2),
 ('Graziano Pelle', 2),
 ('Eder ', 2),
 ('Bogdan Stancu ', 2),
 ('Kolbeinn Sigthorsson ', 2),
 ('Jon Dadi Bodvarsson ', 2),
 ('Hal Robson-Kanu ', 2),
 ('Radja Nainggolan ', 2),
 ('Zoltan Gera ', 1),
 ('Milan Skoda ', 1),
 ('Michy Batshuayi ', 1),
 ('Arnor Ingvi Traustason ', 1),
 ('Ashley Williams ', 1),
 ('Eden Hazard ', 1),
 ('Wayne Rooney ', 1),
 ('Eric Dier ', 1),
 ('Paul Pogba ', 1),
 ('Denis Glushakov ', 1),
 ('Admir Mehmedi ', 1),
 ('Toby Alderweireld ', 1),
 ('Zoltan Stieber ', 1),
 ('Thomas Muller ', 1),
 ('Yannick Carrasco ', 1),
 ('Arkadiusz Milik ', 1),
 ('Nolito ', 1),
 ('Niall McGinn ', 1),
 ('Bastian Schweinsteiger ', 1),
 ('Mesut ozil ', 1),
 ('Wes Hoolahan ', 1),
 ('Robert Lewandowski ', 1),
 ('Emanuele Giaccherini ', 1),
 ('Vladimir Weiss ', 1),
 ('Ozan Tufan ', 1),
 ('Axel Witsel ', 1),
 ('Sam Vokes ', 1),
 ('Jerome Boateng ', 1),
 ('Neil Taylor ', 1),
 ('Alessandro Schopf ', 1),
 ('Fabian Schar ', 1),
 ('Leonardo Bonucci ', 1),
 ('Luka Modric ', 1),
 ('Renato Sanches ', 1),
 ('Aaron Ramsey ', 1),
 ('Ondrej Duda ', 1),
 ('Xherdan Shaqiri ', 1),
 ('Armando Sadiku ', 1),
 ('Adam Szalai ', 1),
 ('Ricardo Quaresma ', 1),
 ('Burak Yilmaz ', 1),
 ('Daniel Sturridge ', 1),
 ('Birkir Saevarsson ', 1),
 ('Marek Hamsik ', 1),
 ('Jamie Vardy ', 1),
 ('Gylfi Sigurdsson ', 1),
 ('Gerard Pique ', 1),
 ('Vasili Berezutski ', 1),
 ('Julian Draxler ', 1),
 ('Ciaran Clark ', 1),
 ('Giorgio Chiellini ', 1),
 ('TomasNecid ', 1),
 ('Ivan Rakitic ', 1),
 ('Nikola Kalinic ', 1)]

In [71]:
pd.merge(goal_details, player_mast, on='player_id').groupby(by='player_name').size().sort_values(ascending=False)

player_name
Antoine Griezmann     6
Olivier Giroud        3
Cristiano Ronaldo     3
Nani                  3
Dimitri Payet         3
                     ..
Leonardo Bonucci      1
Julian Draxler        1
Jerome Boateng        1
Zoltan Gera           1
Aaron Ramsey          1
Length: 76, dtype: int64

#### 36. Write a query in SQL to find the highest individual scorer in EURO cup 2016.

In [72]:
%%sql
SELECT  p.player_name,
        COUNT(*) AS number_of_goals
FROM goal_details g
INNER JOIN player_mast p
    ON g.player_id = p.player_id
GROUP BY p.player_name
ORDER BY COUNT(*) DESC
LIMIT 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Antoine Griezmann ', 6)]

In [73]:
pd.merge(goal_details, player_mast, on='player_id').groupby(by='player_name').size().sort_values(ascending=False).head(1)

player_name
Antoine Griezmann     6
dtype: int64

#### 37. Write a query in SQL to find the scorer along with his country and jersey number in the final of EURO cup 2016.

In [74]:
%%sql
SELECT  p.player_name,
        s.country_name,
        p.jersey_no
FROM goal_details g
INNER JOIN player_mast p
    ON g.player_id = p.player_id
INNER JOIN soccer_country s
    ON g.team_id = s.country_id
WHERE g.play_stage = 'F';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Eder ', 'Portugal', Decimal('9'))]

In [75]:
df_merged = pd.merge(goal_details, player_mast, on='player_id')
df_merged_2 = pd.merge(df_merged, soccer_country, left_on='team_id_x', right_on='country_id')
df_merged_2[df_merged_2['play_stage'] == "F"][['player_name', 'country_name', 'jersey_no']]

   player_name country_name  jersey_no
80       Eder      Portugal        9.0

#### 38. Write a query in SQL to find the player who scored the first goal of EURO cup 2016.

In [76]:
%%sql
SELECT p.player_name
FROM goal_details g
INNER JOIN player_mast p
    ON g.player_id = p.player_id
WHERE g.goal_id = 1
ORDER BY g.match_no, g.goal_time;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Olivier Giroud ',)]

In [77]:
pd.merge(goal_details, player_mast, on='player_id').sort_values(by=['match_no', 'goal_time'])['player_name'].iloc[0]

'Olivier Giroud '

#### 39. Write a query in SQL to find the name and country of the referee who managed the opening match.

In [78]:
%%sql
SELECT  r.referee_name,
        s.country_name
FROM referee_mast r
INNER JOIN match_mast m
    ON r.referee_id = m.referee_id
INNER JOIN soccer_country s
    ON s.country_id = r.country_id
WHERE m.match_no = 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Viktor Kassai', 'Hungary')]

In [79]:
referee_mast = pd.read_sql("SELECT * FROM referee_mast", engine)
df_merged = pd.merge(referee_mast, match_mast, on='referee_id')
df_merged_2 = pd.merge(df_merged, soccer_country, on='country_id')
df_merged_2[df_merged_2['match_no'] == 1][['referee_name', 'country_name']]

     referee_name country_name
20  Viktor Kassai      Hungary

#### 40. Write a query in SQL to find the name and country of the referee who managed the final match.

In [80]:
%%sql
SELECT  r.referee_name,
        s.country_name
FROM referee_mast r
INNER JOIN match_mast m
ON r.referee_id = m.referee_id
INNER JOIN soccer_country s
ON s.country_id = r.country_id
WHERE m.play_stage = 'F';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Mark Clattenburg', 'England')]

In [81]:
df_merged_2[df_merged_2['play_stage'] == 'F'][['referee_name', 'country_name']]

        referee_name country_name
10  Mark Clattenburg      England

#### 41. Write a query in SQL to find the name and country of the assistant referees who assisted the referee in the opening match.

In [82]:
%%sql
SELECT  a.ass_ref_name,
        s.country_name
FROM asst_referee_mast a
INNER JOIN match_details m
    ON a.ass_ref_id = m.ass_ref
INNER JOIN soccer_country s
    ON s.country_id = a.country_id
WHERE m.match_no = 1

 * postgresql://postgres:***@localhost/Soccer
2 rows affected.

[('Gyorgy Ring', 'Hungary'), ('Vencel Toth', 'Hungary')]

In [83]:
asst_referee_mast = pd.read_sql("SELECT * FROM asst_referee_mast", engine)
df_merged = pd.merge(asst_referee_mast, match_details, left_on='ass_ref_id', right_on='ass_ref')
df_merged_2 = pd.merge(df_merged, soccer_country, on='country_id')
df_merged_2[df_merged_2['match_no'] == 1][['ass_ref_name', 'country_name']]

   ass_ref_name country_name
26  Gyorgy Ring      Hungary
29  Vencel Toth      Hungary

#### 42. Write a query in SQL to find the name and country of the assistant referees who assisted the referee in the final match.

In [84]:
%%sql
SELECT  a.ass_ref_name,
        s.country_name
FROM asst_referee_mast a
INNER JOIN match_details m
    ON a.ass_ref_id = m.ass_ref
INNER JOIN soccer_country s
    ON s.country_id = a.country_id
WHERE m.play_stage = 'F';

 * postgresql://postgres:***@localhost/Soccer
2 rows affected.

[('Simon Beck', 'England'), ('Jake Collin', 'England')]

In [85]:
df_merged = pd.merge(asst_referee_mast, match_details, left_on='ass_ref_id', right_on='ass_ref')
df_merged_2 = pd.merge(df_merged, soccer_country, on='country_id')
df_merged_2[df_merged_2['play_stage'] == "F"][['ass_ref_name', 'country_name']]

   ass_ref_name country_name
5    Simon Beck      England
12  Jake Collin      England

#### 43. Write a query in SQL to find the city where the opening match of EURO cup 2016 was played.

In [86]:
%%sql
SELECT sc.city
FROM soccer_venue sv
INNER JOIN soccer_city sc
    ON sv.city_id = sc.city_id
INNER JOIN match_mast m
    ON sv.venue_id = m.venue_id
WHERE m.match_no = 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Saint-Denis',)]

In [87]:
df_merged = pd.merge(soccer_venue, soccer_city, on='city_id')
df_merged_2 = pd.merge(df_merged, match_mast, on='venue_id')
df_merged_2[df_merged_2['match_no'] == 1]['city']

36    Saint-Denis
Name: city, dtype: object

#### 44. Write a query in SQL to find the stadium hosted the final match of EURO cup 2016 along with the capacity, and audiance for that match.

In [88]:
%%sql
SELECT  sv.venue_name AS stadium,
        sv.aud_capacity AS capacity,
        m.audence AS spectators
FROM soccer_venue sv
INNER JOIN soccer_city sc
    ON sv.city_id = sc.city_id
INNER JOIN match_mast m
    ON sv.venue_id = m.venue_id
WHERE m.play_stage = 'F';

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Stade de France', Decimal('80100'), Decimal('75868'))]

In [89]:
df_merged = pd.merge(soccer_venue, soccer_city, on='city_id')
df_merged_2 = pd.merge(df_merged, match_mast, on='venue_id')
df_merged_2[df_merged_2['play_stage'] == 'F'][['venue_name', 'aud_capacity', 'audence']]

         venue_name  aud_capacity  audence
42  Stade de France       80100.0  75868.0

#### 45. Write a query in SQL to compute a report that contain the number of matches played in each venue along with their city.

In [90]:
%%sql
SELECT  sv.venue_name,
        sc.city,
        COUNT(*) AS number_of_matches
FROM soccer_venue sv
INNER JOIN soccer_city sc
    ON sv.city_id = sc.city_id
INNER JOIN match_mast m
    ON sv.venue_id = m.venue_id
GROUP BY sv.venue_name, sc.city
ORDER BY COUNT(*) DESC;

 * postgresql://postgres:***@localhost/Soccer
10 rows affected.

[('Stade de France', 'Saint-Denis', 7),
 ('Stade VElodrome', 'Marseille', 6),
 ('Stade de Lyon', 'Lyon', 6),
 ('Stade Pierre Mauroy', 'Lille', 6),
 ('Stade de Bordeaux', 'Bordeaux', 5),
 ('Parc des Princes', 'Paris', 5),
 ('Stade Bollaert-Delelis', 'Lens', 4),
 ('Stade Geoffroy Guichard', 'Saint-Etienne', 4),
 ('Stade de Nice', 'Nice', 4),
 ('Stadium de Toulouse', 'Toulouse', 4)]

In [91]:
df_merged = pd.merge(soccer_venue, soccer_city, on='city_id')
pd.merge(df_merged, match_mast, on='venue_id').groupby(by=['venue_name', 'city']).size().sort_values(ascending=False)

venue_name               city
Stade de France          Saint-Denis      7
Stade de Lyon            Lyon             6
Stade VElodrome          Marseille        6
Stade Pierre Mauroy      Lille            6
Stade de Bordeaux        Bordeaux         5
Parc des Princes         Paris            5
Stadium de Toulouse      Toulouse         4
Stade de Nice            Nice             4
Stade Geoffroy Guichard  Saint-Etienne    4
Stade Bollaert-Delelis   Lens             4
dtype: int64

#### 46. Write a query in SQL to find the first player who was sent off at the tournament EURO cup 2016.

In [92]:
%%sql
SELECT pm.player_name
FROM player_booked pb
INNER JOIN player_mast pm
    ON pb.player_id = pm.player_id
WHERE pb.sent_off = 'Y'
ORDER BY pb.match_no
LIMIT 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Olivier Giroud ',)]

In [93]:
player_booked = pd.read_sql("SELECT * FROM player_booked", engine)
df_merged = pd.merge(player_booked, player_mast, on='player_id')
df_merged[df_merged['sent_off'] == "Y"].sort_values(by='match_no').iloc[0]['player_name']

'Olivier Giroud '

#### 47. Write a query in SQL to find the teams that scored only one goal.

In [94]:
%%sql
SELECT sc.country_name
FROM soccer_team st
INNER JOIN soccer_country sc
    ON st.team_id = sc.country_id
WHERE st.goal_for = 1;

 * postgresql://postgres:***@localhost/Soccer
3 rows affected.

[('Albania',), ('Austria',), ('Sweden',)]

In [95]:
soccer_team = pd.read_sql("SELECT * FROM soccer_team", engine)
df_merged = pd.merge(soccer_team, soccer_country, left_on='team_id', right_on='country_id')
df_merged[df_merged['goal_for'] == 1]['country_name']

0     Albania
1     Austria
19     Sweden
Name: country_name, dtype: object

#### 48. Write a query in SQL to find the yellow cards received by each country.

In [96]:
%%sql
SELECT  s.country_name,
        COUNT(*) as yellow_cards
FROM player_booked p
INNER JOIN soccer_country s
    ON s.country_id = p.team_id
GROUP BY s.country_name
ORDER BY COUNT(*) DESC;

 * postgresql://postgres:***@localhost/Soccer
24 rows affected.

[('Italy', 16),
 ('Portugal', 13),
 ('France', 13),
 ('Iceland', 12),
 ('Hungary', 12),
 ('Wales', 11),
 ('Germany', 11),
 ('Romania', 10),
 ('Albania', 10),
 ('Poland', 10),
 ('Slovakia', 9),
 ('Republic of Ireland', 9),
 ('Belgium', 9),
 ('Croatia', 8),
 ('Austria', 7),
 ('Turkey', 7),
 ('Northern Ireland', 6),
 ('Switzerland', 5),
 ('Spain', 5),
 ('Czech Republic', 5),
 ('Ukraine', 5),
 ('Sweden', 3),
 ('England', 3),
 ('Russia', 2)]

In [97]:
pd.merge(player_booked, soccer_country, left_on='team_id', right_on='country_id').groupby(by='country_name').size().sort_values(ascending=False)

country_name
Italy                  16
Portugal               13
France                 13
Hungary                12
Iceland                12
Wales                  11
Germany                11
Poland                 10
Albania                10
Romania                10
Republic of Ireland     9
Slovakia                9
Belgium                 9
Croatia                 8
Turkey                  7
Austria                 7
Northern Ireland        6
Ukraine                 5
Spain                   5
Switzerland             5
Czech Republic          5
Sweden                  3
England                 3
Russia                  2
dtype: int64

#### 49. Write a query in SQL to find the venue with number of goals that has seen.

In [98]:
%%sql
SELECT  s.venue_name,
        COUNT(*) AS number_of_goals
FROM soccer_venue s
INNER JOIN match_mast m
    ON s.venue_id = m.venue_id
INNER JOIN goal_details g
    ON g.match_no = m.match_no
GROUP BY s.venue_name
ORDER BY COUNT(*) DESC;

 * postgresql://postgres:***@localhost/Soccer
10 rows affected.

[('Stade de France', 18),
 ('Stade de Lyon', 16),
 ('Stade Pierre Mauroy', 13),
 ('Stade de Bordeaux', 13),
 ('Stade VElodrome', 11),
 ('Stadium de Toulouse', 9),
 ('Stade de Nice', 8),
 ('Stade Geoffroy Guichard', 8),
 ('Stade Bollaert-Delelis', 7),
 ('Parc des Princes', 5)]

In [99]:
df = pd.merge(soccer_venue, match_mast, on='venue_id' )
pd.merge(df, goal_details, on ='match_no').groupby(by='venue_name').size().sort_values(ascending=False)

venue_name
Stade de France            18
Stade de Lyon              16
Stade de Bordeaux          13
Stade Pierre Mauroy        13
Stade VElodrome            11
Stadium de Toulouse         9
Stade de Nice               8
Stade Geoffroy Guichard     8
Stade Bollaert-Delelis      7
Parc des Princes            5
dtype: int64

#### 50. Write a query in SQL to find the match where no stoppage time added in 1st half of play.

In [100]:
%%sql
SELECT  mm.match_no,
        s.country_name
FROM match_mast mm
INNER JOIN match_details md
    ON mm.match_no = md.match_no
INNER JOIN soccer_country s
    ON md.team_id = s.country_id
WHERE mm.stop1_sec = 0;

 * postgresql://postgres:***@localhost/Soccer
2 rows affected.

[(Decimal('4'), 'England'), (Decimal('4'), 'Russia')]

In [101]:
df_merged = pd.merge(match_mast, match_details, on='match_no')
df_merged_2 = pd.merge(df_merged, soccer_country, left_on='team_id', right_on='country_id')
df_merged_2[df_merged_2['stop1_sec'] == 0][['match_no', 'country_name']]

    match_no country_name
27       4.0      England
31       4.0       Russia

#### 51. Write a query in SQL to find the team(s) who conceded the most goals in EURO cup 2016.

In [102]:
%%sql
SELECT sc.country_name
FROM soccer_team st
INNER JOIN soccer_country sc
    ON st.team_id = sc.country_id
ORDER BY st.goal_agnst DESC
LIMIT 1;

 * postgresql://postgres:***@localhost/Soccer
1 rows affected.

[('Russia',)]

In [103]:
pd.merge(soccer_team, soccer_country, left_on='team_id', right_on='country_id').sort_values(by='goal_agnst', ascending=False)['country_name'].iloc[0]

'Russia'

#### 52. Write a query in SQL to find the oldest player to have appeared in a EURO cup 2016 match.

In [104]:
%%sql
SELECT  p.player_name,
        s.country_name,
        p.age
FROM player_mast p
INNER JOIN soccer_country s
    ON p.team_id = s.country_id
WHERE p.age IN (SELECT MAX(age)
                FROM player_mast );

 * postgresql://postgres:***@localhost/Soccer
2 rows affected.

[('Gabor Kiraly ', 'Hungary', Decimal('40')),
 ('Shay Given ', 'Republic of Ireland', Decimal('40'))]

In [105]:
df_merged = pd.merge(player_mast, soccer_country, left_on='team_id', right_on='country_id')
df_merged.sort_values(by='age', ascending=False).iloc[:2][['player_name', 'age', 'country_name']]

       player_name   age         country_name
184  Gabor Kiraly   40.0              Hungary
337    Shay Given   40.0  Republic of Ireland